Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70J20.PIC
      <edc:SFRDef edc:_addr="0x40038644" edc:access="--------------ww-w-w----wwwwwwww" edc:cname="USBHS_HSTPIPIDR9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:desc="Received IN Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:desc="Transmitted OUT Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPEC" edc:desc="Transmitted SETUP Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:desc="Pipe Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:desc="NAKed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:desc="Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDEC" edc:desc="Received STALLed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:desc="Short Packet Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:desc="Pipe Interrupts Disable HDMA Request Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:desc="Pipe Freeze Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038648" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038650" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ0" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038654" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038658" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003865C" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ3" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038660" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ4" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038664" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038668" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003866C" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038670" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
