Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70J20.PIC
      <edc:SFRDef edc:_addr="0x40050710" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW02" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050714" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW12" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050718" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW03" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005071C" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW13" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050720" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW04" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050724" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW14" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050728" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW05" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005072C" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW15" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050730" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW06" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050734" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW16" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050738" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_ST2CW07" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MASKVAL" edc:desc="Mask Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="COMPVAL" edc:desc="Compare Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005073C" edc:access="-----------------------nnnnnnnnn" edc:cname="GMAC_ST2CW17" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSVAL" edc:desc="Offset Value in Bytes" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="OFFSSTRT" edc:desc="Ethernet Frame Offset Start" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FRAMESTART" edc:desc="Offset from the start of the frame" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ETHERTYPE" edc:desc="Offset from the byte after the EtherType field" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IP" edc:desc="Offset from the byte after the IP header field" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TCP_UDP" edc:desc="Offset from the byte after the TCP/UDP header field" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
