Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70J20.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCRS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPCK" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RF" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="HSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="VSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLLUSB"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>